#+TITLE: APISnoop Vocabulary

*** generated as part of generate_coverage_report             :processedLogs:
     [[file:data-gen/processAuditlog.py::if%20event.get('userAgent',%20False)%20and%20useragent.startswith('e2e.test'):][link to code]]

   At start of coverage report, tests is made as an empty dict.
   It is populated only if =event.get('userAgent', False)= AND =useragent.startswith('e2e.test')=

   I believe what this means is we are looking to see if that event //had// a User-Agent and if so, if it started with e2e.test.  If both are true, we know that we can look for the test names within this.
   #+NAME: relevant code within generate_coverage_report
   #+BEGIN_SRC python
# starts at line 276
     if event.get('userAgent', False) and useragent.startswith('e2e.test'):
         test_name_start = ' -- '
         if useragent.find(test_name_start) > -1:
             test_name = useragent.split(test_name_start)[1]
             if test_name not in tests.keys():
                 tests[test_name] = {}
             if test_name not in test_sequences.keys():
                 test_sequences[test_name] = []
             test_sequences[test_name].append([event['requestReceivedTimestamp'],
                                               level, category, method, op])
             if op not in tests[test_name].keys():
                 tests[test_name][op] = {}
             if method not in tests[test_name][op].keys():
                 tests[test_name][op][method] = {
                     "counter": 0
                 }
             tests[test_name][op][method]["counter"] += 1
             tags = re.findall(r'\[.+?\]', test_name)
             for tag in tags:
                 if tag not in test_tags.keys():
                     test_tags[tag] = {}
                 if op not in test_tags[tag].keys():
                     test_tags[tag][op] = {}
                 if method not in test_tags[tag][op].keys():
                     test_tags[tag][op][method] = {
                         "counter": 0
                     }
                 test_tags[tag][op][method]["counter"] += 1
                 if tag not in endpoints[op][method]['test_tags']:
                     endpoints[op][method]['test_tags'].append(tag)
                 if test_name not in endpoints[op][method]['tests']:
                     endpoints[op][method]['tests'].append(test_name)
                 # if tag not in sb_method['test_tags']:
                 #     sb_method['test_tags'].append(tag)

     else:
         # IF we hit here, this is NOT an e2e.test user agent
         if user_agent_available: # 12 and higher
           pass # go on to user agent processing (e2e only)
           # continue # do no further processing (e2e + other)
         else: # 11 and lower
           # Only look at e2e for now, skip anything else
           pass #(log everything)
           # continue # stop here

     endpoints[op][method]["counter"] += 1
     agent = event.get('userAgent', ' ').split(' ')[0]
     if agent not in useragents.keys():
         useragents[agent] = {}
     if op not in useragents[agent].keys():
         useragents[agent][op] = {}
     if method not in useragents[agent][op].keys():
         useragents[agent][op][method] = {
             "counter": 0
         }
     useragents[agent][op][method]["counter"] += 1
     # sunburst[level][category][path][method]['counter'] += 1
     # if agent not in sb_method['agents']:
     #     sb_method['agents'].append(agent)
     # if agent not in sb_method['agents']:
     #     sb_method['agents'].append(agent)
     #     sunburst[level][category][path][method]['agents'].append(agent)
   #+END_SRC

   And so once it finds the tests, it looks to see if that test already exists within op[method][tests] and creates it if not.  If it does, then it ups the counter for tests[op][method].  It's through this counter that we know how many times this particular operationId method is hit by this test.

   In this sample, you can see the test has a long name plus a number of tags as =[tag_name]=.  The output will be a list of operatorId's containing their methods, and within that a counter saying how many times that particular test hit that particular method.
   #+NAME: Example Test Object
   #+BEGIN_SRC shell :dir ./data-gen/processed/ci-kubernetes-e2e-gci-gce/36092 :results output
cat apisnoop.json | jq '.tests["[k8s.io] Container Lifecycle Hook when create a pod with lifecycle hook should execute poststart exec hook properly [NodeConformance] [Conformance]"]'
   #+END_SRC
   #+RESULTS: Example Test Object
   #+begin_example
   {
     "listCoreV1NamespacedPod": {
       "get": {
         "counter": 12
       }
     },
     "listRbacAuthorizationV1NamespacedRole": {
       "get": {
         "counter": 1
       }
     },
     "getCertificatesV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getAuthenticationV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listExtensionsV1beta1NamespacedDaemonSet": {
       "get": {
         "counter": 1
       }
     },
     "getRbacAuthorizationV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "createCoreV1NamespacedPod": {
       "post": {
         "counter": 2
       }
     },
     "getBatchV2alpha1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getExtensionsV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listNetworkingV1NamespacedNetworkPolicy": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedServiceAccount": {
       "watch": {
         "counter": 4
       },
       "get": {
         "counter": 1
       }
     },
     "getSchedulingV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedReplicationController": {
       "get": {
         "counter": 1
       }
     },
     "getAPIVersions": {
       "get": {
         "counter": 1
       }
     },
     "getBatchV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listAppsV1NamespacedReplicaSet": {
       "get": {
         "counter": 1
       }
     },
     "readCoreV1Namespace": {
       "get": {
         "counter": 14
       }
     },
     "getAutoscalingV2beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getRbacAuthorizationV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getAppsV1beta2APIResources": {
       "get": {
         "counter": 1
       }
     },
     "readCoreV1NamespacedPodLog": {
       "get": {
         "counter": 2
       }
     },
     "getSchedulingV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getApiregistrationV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getAutoscalingV2beta2APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedSecret": {
       "get": {
         "counter": 1
       }
     },
     "listAppsV1NamespacedDeployment": {
       "get": {
         "counter": 1
       }
     },
     "readCoreV1NamespacedPod": {
       "get": {
         "counter": 7
       }
     },
     "listExtensionsV1beta1NamespacedIngress": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedLimitRange": {
       "get": {
         "counter": 1
       }
     },
     "listAppsV1NamespacedDaemonSet": {
       "get": {
         "counter": 1
       }
     },
     "getAdmissionregistrationV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "createRbacAuthorizationV1beta1NamespacedRoleBinding": {
       "post": {
         "counter": 1
       }
     },
     "getAuthorizationV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getNodeV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listBatchV1NamespacedJob": {
       "get": {
         "counter": 1
       }
     },
     "listCoordinationV1NamespacedLease": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedConfigMap": {
       "get": {
         "counter": 1
       }
     },
     "listPolicyV1beta1NamespacedPodDisruptionBudget": {
       "get": {
         "counter": 1
       }
     },
     "deleteCoreV1NamespacedPod": {
       "delete": {
         "counter": 1
       }
     },
     "listRbacAuthorizationV1NamespacedRoleBinding": {
       "get": {
         "counter": 1
       }
     },
     "listBatchV1beta1NamespacedCronJob": {
       "get": {
         "counter": 1
       }
     },
     "getSettingsV1alpha1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "createCoreV1Namespace": {
       "post": {
         "counter": 1
       }
     },
     "listAppsV1NamespacedControllerRevision": {
       "get": {
         "counter": 1
       }
     },
     "getAuthenticationV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getBatchV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getNetworkingV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedEndpoints": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedService": {
       "get": {
         "counter": 1
       }
     },
     "listExtensionsV1beta1NamespacedDeployment": {
       "get": {
         "counter": 1
       }
     },
     "listSettingsV1alpha1NamespacedPodPreset": {
       "get": {
         "counter": 1
       }
     },
     "getApiregistrationV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getNetworkingV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getEventsV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "createAuthorizationV1beta1SubjectAccessReview": {
       "post": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedPodTemplate": {
       "get": {
         "counter": 1
       }
     },
     "getCoordinationV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listAutoscalingV1NamespacedHorizontalPodAutoscaler": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedResourceQuota": {
       "get": {
         "counter": 1
       }
     },
     "getStorageV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1Node": {
       "get": {
         "counter": 1
       }
     },
     "listAppsV1NamespacedStatefulSet": {
       "get": {
         "counter": 1
       }
     },
     "listExtensionsV1beta1NamespacedReplicaSet": {
       "get": {
         "counter": 1
       }
     },
     "getAppsV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getPolicyV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getCoordinationV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listExtensionsV1beta1NamespacedNetworkPolicy": {
       "get": {
         "counter": 1
       }
     },
     "deleteCoreV1Namespace": {
       "delete": {
         "counter": 1
       }
     },
     "getAutoscalingV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getSchedulingV1alpha1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getAuthorizationV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listEventsV1beta1NamespacedEvent": {
       "get": {
         "counter": 1
       }
     },
     "getCoreAPIVersions": {
       "get": {
         "counter": 1
       }
     },
     "getApiextensionsV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listNetworkingV1beta1NamespacedIngress": {
       "get": {
         "counter": 1
       }
     },
     "getAppsV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getCoreV1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "getStorageV1beta1APIResources": {
       "get": {
         "counter": 1
       }
     },
     "listCoreV1NamespacedPersistentVolumeClaim": {
       "get": {
         "counter": 1
       }
     }
   }
   #+end_example

*** generated as part of generate_coverage_report             :processedLogs:
     [[file:data-gen/processAuditlog.py::if%20event.get('userAgent',%20False)%20and%20useragent.startswith('e2e.test'):][link to code]]

   At start of coverage report, test_tags is made as an empty dict.
   It is populated only if =event.get('userAgent', False)= AND =useragent.startswith('e2e.test')=
   It works as part of the same if loop as =tests=.  relevant code below
  #+NAME: Relevant Code for test_sequences
  #+BEGIN_SRC python
    if event.get('userAgent', False) and useragent.startswith('e2e.test'):
        test_name_start = ' -- '
        if useragent.find(test_name_start) > -1:
            test_name = useragent.split(test_name_start)[1]
            if test_name not in test_sequences.keys():
                test_sequences[test_name] = []
                test_sequences[test_name].append([event['requestReceivedTimestamp'],
                                                level, category, method, op])
  #+END_SRC

  And so if the test doesn't already exist in test_sequences, it's created and then we add to it's list a string with timestamp, level, category, method, op for this particular test. So when a new endoint is looked at, and we find the test again, this is also added to the sequence.  In this way, when we click on a test and see its sequence, we are seeing every operatorId[method] this test hit, and at what time.

   #+NAME: Example Test_Sequences Object
   #+BEGIN_SRC shell :dir ./data-gen/processed/ci-kubernetes-e2e-gci-gce/36092 :results output
cat apisnoop.json | jq '.test_sequences["[k8s.io] Container Lifecycle Hook when create a pod with lifecycle hook should execute poststart exec hook properly [NodeConformance] [Conformance]"]'
   #+END_SRC

   #+RESULTS: Example Test_Sequences Object
   #+begin_example
   [
     [
       "2019-03-26T00:26:09.778106Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:09.874798Z",
       "stable",
       "core",
       "post",
       "createCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:10.058231Z",
       "stable",
       "core",
       "watch",
       "listCoreV1NamespacedServiceAccount"
     ],
     [
       "2019-03-26T00:26:10.058231Z",
       "stable",
       "core",
       "watch",
       "listCoreV1NamespacedServiceAccount"
     ],
     [
       "2019-03-26T00:26:10.254343Z",
       "beta",
       "rbacAuthorization",
       "post",
       "createRbacAuthorizationV1beta1NamespacedRoleBinding"
     ],
     [
       "2019-03-26T00:26:10.408718Z",
       "beta",
       "authorization",
       "post",
       "createAuthorizationV1beta1SubjectAccessReview"
     ],
     [
       "2019-03-26T00:26:10.454147Z",
       "stable",
       "core",
       "watch",
       "listCoreV1NamespacedServiceAccount"
     ],
     [
       "2019-03-26T00:26:10.454147Z",
       "stable",
       "core",
       "watch",
       "listCoreV1NamespacedServiceAccount"
     ],
     [
       "2019-03-26T00:26:10.518767Z",
       "stable",
       "core",
       "post",
       "createCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:10.590589Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:12.656154Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:12.713070Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:12.754615Z",
       "stable",
       "core",
       "post",
       "createCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:12.802496Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:14.845880Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:16.858815Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:17.088332Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:17.229833Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPodLog"
     ],
     [
       "2019-03-26T00:26:17.229833Z",
       "stable",
       "core",
       "get",
       "readCoreV1NamespacedPodLog"
     ],
     [
       "2019-03-26T00:26:17.351838Z",
       "stable",
       "core",
       "delete",
       "deleteCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:17.419434Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:19.487298Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:21.490188Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:23.488923Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:25.485860Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:27.489263Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:29.504735Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:31.489217Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:33.538381Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:35.484512Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:37.485315Z",
       "stable",
       "core",
       "get",
       "listCoreV1NamespacedPod"
     ],
     [
       "2019-03-26T00:26:37.538757Z",
       "stable",
       "core",
       "get",
       "listCoreV1Node"
     ],
     [
       "2019-03-26T00:26:37.633237Z",
       "stable",
       "core",
       "delete",
       "deleteCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:37.703790Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:39.773001Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:41.753431Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:43.752393Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:45.752690Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:47.754909Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:49.775389Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:51.764497Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:53.759594Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:55.749452Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:57.782862Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:26:59.753060Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:27:01.750654Z",
       "stable",
       "core",
       "get",
       "readCoreV1Namespace"
     ],
     [
       "2019-03-26T00:27:01.800811Z",
       "stable",
       "core",
       "get",
       "getCoreAPIVersions"
     ],
     [
       "2019-03-26T00:27:01.858230Z",
       "stable",
       "apis",
       "get",
       "getAPIVersions"
     ],
     [
       "2019-03-26T00:27:01.909723Z",
       "beta",
       "policy",
       "get",
       "getPolicyV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.911174Z",
       "stable",
       "scheduling",
       "get",
       "getSchedulingV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.911599Z",
       "stable",
       "apps",
       "get",
       "getAppsV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.912539Z",
       "beta",
       "events",
       "get",
       "getEventsV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.913061Z",
       "stable",
       "apiregistration",
       "get",
       "getApiregistrationV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.913470Z",
       "beta",
       "authentication",
       "get",
       "getAuthenticationV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.913794Z",
       "beta",
       "scheduling",
       "get",
       "getSchedulingV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.914502Z",
       "stable",
       "batch",
       "get",
       "getBatchV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.914854Z",
       "beta",
       "authorization",
       "get",
       "getAuthorizationV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.916175Z",
       "beta",
       "storage",
       "get",
       "getStorageV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.916580Z",
       "beta",
       "networking",
       "get",
       "getNetworkingV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.916903Z",
       "beta",
       "coordination",
       "get",
       "getCoordinationV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.917735Z",
       "alpha",
       "settings",
       "get",
       "getSettingsV1alpha1APIResources"
     ],
     [
       "2019-03-26T00:27:01.919051Z",
       "beta",
       "certificates",
       "get",
       "getCertificatesV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.919478Z",
       "stable",
       "storage",
       "get",
       "getStorageV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.919865Z",
       "alpha",
       "scheduling",
       "get",
       "getSchedulingV1alpha1APIResources"
     ],
     [
       "2019-03-26T00:27:01.920336Z",
       "beta",
       "apps",
       "get",
       "getAppsV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.920675Z",
       "beta",
       "rbacAuthorization",
       "get",
       "getRbacAuthorizationV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.921891Z",
       "stable",
       "core",
       "get",
       "getCoreV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.922666Z",
       "beta",
       "autoscaling",
       "get",
       "getAutoscalingV2beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.923270Z",
       "stable",
       "rbacAuthorization",
       "get",
       "getRbacAuthorizationV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.923677Z",
       "beta",
       "extensions",
       "get",
       "getExtensionsV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.924894Z",
       "alpha",
       "batch",
       "get",
       "getBatchV2alpha1APIResources"
     ],
     [
       "2019-03-26T00:27:01.925394Z",
       "stable",
       "networking",
       "get",
       "getNetworkingV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.925773Z",
       "beta",
       "apps",
       "get",
       "getAppsV1beta2APIResources"
     ],
     [
       "2019-03-26T00:27:01.926283Z",
       "stable",
       "authentication",
       "get",
       "getAuthenticationV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.926614Z",
       "beta",
       "node",
       "get",
       "getNodeV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.926921Z",
       "beta",
       "autoscaling",
       "get",
       "getAutoscalingV2beta2APIResources"
     ],
     [
       "2019-03-26T00:27:01.928389Z",
       "beta",
       "apiregistration",
       "get",
       "getApiregistrationV1beta1APIResources"
     ],
     [
       "2019-03-26T00:27:01.928767Z",
       "stable",
       "authorization",
       "get",
       "getAuthorizationV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.929187Z",
       "stable",
       "autoscaling",
       "get",
       "getAutoscalingV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.929514Z",
       "stable",
       "coordination",
       "get",
       "getCoordinationV1APIResources"
     ],
     [
       "2019-03-26T00:27:01.929839Z",
       "beta",
       "batch",
       "get",
       "getBatchV1beta1APIResources"
     ]
   ]
   #+end_example

* Global / Agreed
  :LOGBOOK:
  CLOCK: [2019-04-04 Thu 10:56]--[2019-04-04 Thu 11:21] =>  0:25
  :END:
  - level :: level of stability/support for an api version. See [[https://kubernetes.io/docs/reference/using-api/api-overview/#api-versioning][K8s Docs: API Versioning]]
  - category ::
  -  ::
